org/emacs.org
#+title: Emacs

* About Emacs

  [[https://en.wikipedia.org/wiki/Emacs][Emacs]] is a family of text editors with the first version developed
  in the mid-1970s. I'm using *[[https://www.gnu.org/software/emacs/][GNU Emacs]]* that is free software and
  the most widely used variant. The core Emacs functionality can be
  extended and highly customized using [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][Emacs Lisp]]. Emacs works both in
  a graphical desktop environment and in a text-based terminal.

* Guides

- [[https://github.com/hubisan/emacs-wsl][Emacs-WSL]] — Guide and scripts for installing Emacs with the Windows
  Subsystem for Linux on Windows 10 using Ubuntu 20.04 LTS

* FAQ

- [[https://unix.stackexchange.com/a/406519][How can mouse support be enabled in terminal Emacs?]]

* Tips and Tricks
  
- [[Http://pragmaticemacs.com/emacs/use-bookmarks-to-jump-to-files-or-directories/][Use Bookmarks to Jump to Files or Directories]]

* Org-Mode

- [[http://members.optusnet.com.au/~charles57/GTD/datetree.html][Capture mode and Date Trees in org-mode]]
- [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][Orgmode for GTD]] — Guide to using Org-Mode for Getting Things Done
  (GTD)
- [[https://emacsclub.github.io/html/org_tutorial.html][Org-mode Tutorial / Cheat Sheet]]
- [[https://orgmode.org/manual/Publishing-options.html][Options for org-mode exporters]]
- [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][Publishing Org-mode files to HTML]]
- [[https://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/][Learn how to take notes more efficiently in Org Mode]]
- [[https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html][Personal website in org]]
