emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-03 Wed 09:09 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="author" content="Søren Lund" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<!-- begin: html/preamble.html -->
<header>
<h1>Bookmarks</h1>
<nav>
<a href="index.html">Home</a> ❙
<a href="incoming.html">Incoming</a> ❙
<a href="about.html">About</a>
</nav>
</header>
<!-- end: html/preamble.html -->
</div>
<div id="content" class="content">
<h1 class="title">Emacs</h1>

<div id="outline-container-orge762cfe" class="outline-2">
<h2 id="orge762cfe">About Emacs</h2>
<div class="outline-text-2" id="text-orge762cfe">
<p>
<a href="https://en.wikipedia.org/wiki/Emacs">Emacs</a> is a family of text editors with the first version developed
in the mid-1970s. I'm using <b><a href="https://www.gnu.org/software/emacs/">GNU Emacs</a></b> that is free software and
the most widely used variant. The core Emacs functionality can be
extended and highly customized using <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/">Emacs Lisp</a>. Emacs works both in
a graphical desktop environment and in a text-based terminal.
</p>
</div>
</div>

<div id="outline-container-org5eeac3f" class="outline-2">
<h2 id="org5eeac3f">Guides</h2>
<div class="outline-text-2" id="text-org5eeac3f">
<ul class="org-ul">
<li><a href="https://github.com/hubisan/emacs-wsl">Emacs-WSL</a> — Guide and scripts for installing Emacs with the Windows
Subsystem for Linux on Windows 10 using Ubuntu 20.04 LTS</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7c3eff" class="outline-2">
<h2 id="orgf7c3eff">FAQ</h2>
<div class="outline-text-2" id="text-orgf7c3eff">
<ul class="org-ul">
<li><a href="https://unix.stackexchange.com/a/406519">How can mouse support be enabled in terminal Emacs?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4b0a23a" class="outline-2">
<h2 id="org4b0a23a">Tips and Tricks</h2>
<div class="outline-text-2" id="text-org4b0a23a">
<ul class="org-ul">
<li><a href="//pragmaticemacs.com/emacs/use-bookmarks-to-jump-to-files-or-directories/">Use Bookmarks to Jump to Files or Directories</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4322cb5" class="outline-2">
<h2 id="org4322cb5">Org-Mode</h2>
<div class="outline-text-2" id="text-org4322cb5">
<ul class="org-ul">
<li><a href="http://members.optusnet.com.au/~charles57/GTD/datetree.html">Capture mode and Date Trees in org-mode</a></li>
<li><a href="https://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/">Learn how to take notes more efficiently in Org Mode</a></li>
<li><a href="https://orgmode.org/manual/Publishing-options.html">Options for org-mode exporters</a></li>
<li><a href="https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html">Orgmode for GTD</a> — Guide to using Org-Mode for Getting Things Done
(GTD)</li>
<li><a href="https://nhigham.com/2017/11/02/org-mode-syntax-cheat-sheet/">Org Mode Syntax Cheat Sheet</a></li>
<li><a href="https://emacsclub.github.io/html/org_tutorial.html">Org-mode Tutorial / Cheat Sheet</a></li>
<li><a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html">Personal website in org</a></li>
<li><a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Publishing Org-mode files to HTML</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
<p>&copy; 2021 Søren Lund</p>
</footer>
</div>
</body>
</html>
